#pragma once
#include "include.h"
#include "CGAL_utils.h"

//可视化 Face到分割图map上
//---------------------------------------------------------------------------------
cv::Mat show_face_on_map(Face_handle f, cv::Mat map, pcInfo info);
//---------------------------------------------------------------------------------

//可视化 相邻边 到分割图map上
//---------------------------------------------------------------------------------
cv::Mat show_adjacent_on_map(Halfedge_handle edge, cv::Mat map, pcInfo info);
//---------------------------------------------------------------------------------

// 可视化 点 到 分割图map上
//---------------------------------------------------------------------------------
cv::Mat show_random_points_on_map(std::vector<Point> random_points, cv::Mat map, pcInfo info);
//---------------------------------------------------------------------------------

// 可视化 Arrangement在分割图map上
//---------------------------------------------------------------------------------
void show_arr_on_map(Arrangement arr, cv::Mat map, pcInfo info);
//---------------------------------------------------------------------------------

// 可视化 线段 分割图map上
//---------------------------------------------------------------------------------
void show_Segments_on_map(std::vector<Segment>& segments, cv::Mat map, pcInfo info);
//---------------------------------------------------------------------------------


